eisup_2019_docmng_integration/src/Catalogs/ВнешниеОбработки/ВнешниеОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеОбработки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ХранилищеВнешнейОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбработки</name>
    <type>
      <types>EnumRef.ВидыДополнительныхВнешнихОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКФайлуИсточнику</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИспользуетсяДЗО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ИспользуетсяКазначеями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентноеЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗаданиеGUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Принадлежность</name>
    <attributes>
      <name>ПредставлениеОбъекта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаОбъекта</name>
      <type>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ТабличнаяЧастьИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТабличнаяЧастьПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиПостроителяДляОтбора</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеВнешнейОбработки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменяемаяПечатнаяФорма</name>
      <type>
        <types>CatalogRef.ВнешниеОбработки</types>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПечатнойФормы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеОтбораПостроителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКнопки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеПараметрыОбработки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>МетаданныеОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗапуска</name>
      <type>
        <types>EnumRef.СпособыЗапускаВнешнихОбработокВОтчетахНаБазеУниверсального</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеНастроекОбработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_ИсторияИзменения</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Enums/ВидыДополнительныхВнешнихОбработок/ВидыДополнительныхВнешнихОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДополнительныхВнешнихОбработок</name>
  <enumValues>
    <name>ПечатнаяФорма</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнениеТабличныхЧастей</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>Отчет</name>
    <comment>Внешний отчет</comment>
  </enumValues>
  <enumValues>
    <name>ВнешняяОбработкаПодключаемаяКОтчету</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ВнешниеОбработки/ObjectModule.bsl
Перем ПрошлыйИзмененныйРодительОбъектаДоступа;

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		ПрошлыйИзмененныйРодительОбъектаДоступа = ?(Не ЭтоНовый() и Не Ссылка.Родитель = Родитель, Ссылка.Родитель, Неопределено);
		НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель);
		
		#Если Клиент Тогда
		Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ЗаполнениеТабличныхЧастей Тогда
				
			// Сообщить о неуказанных табличных частей для заполнения.
			Для Каждого СтрокаПринадлежность Из Принадлежность Цикл
					
				Если ПустаяСтрока(СтрокаПринадлежность.ТабличнаяЧастьИмя) ИЛИ ПустаяСтрока(СтрокаПринадлежность.ТабличнаяЧастьПредставление) Тогда
					Сообщить("Не указана табличная часть для заполнения: " + СтрокаПринадлежность.ПредставлениеОбъекта, СтатусСообщения.Внимание);
				КонецЕсли;
					
			КонецЦикла;
				
		КонецЕсли;
		#КонецЕсли
		
		//Для истории записи обработок
		Если Модифицированность() и ПометкаУдаления и не ссылка.ПометкаУдаления и НЕ ЭтоГруппа Тогда
			
			врСтрока = абс_ИсторияИзменения.Добавить();
			врСтрока.Период = ТекущаяДата();
			врСтрока.Владелец = глЗначениеПеременной("глТекущийПользователь");
			врСтрока.Разработчик = глЗначениеПеременной("глТекущийПользователь");
			врСтрока.Описание = "Пометил на удаление элемент.";
			
		КонецЕсли;
		
		Если Модифицированность() и не ПометкаУдаления и ссылка.ПометкаУдаления и НЕ ЭтоГруппа Тогда
			
			врСтрока = абс_ИсторияИзменения.Добавить();
			врСтрока.Период = ТекущаяДата();
			врСтрока.Владелец = глЗначениеПеременной("глТекущийПользователь");
			врСтрока.Разработчик = глЗначениеПеременной("глТекущийПользователь");
			врСтрока.Описание = "Снял пометку удаления элемента.";
			
		КонецЕсли;		
			
		Если Модифицированность() и не ПометкаУдаления и не ссылка.ПометкаУдаления и НЕ ЭтоГруппа Тогда
	                              			
			//Проверка, что есть хотя бы одна строка в тч
			Если Не ЗначениеЗаполнено(абс_ИсторияИзменения) Тогда
				Сообщить("Заполните поле владелец и описание (не менее 20 символов) в табличной части:""История изменения""",СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;	
			
			//Проверка полей
			НайденаСтрокаВПределахЧаса = Ложь;
			Для каждого Строка Из абс_ИсторияИзменения Цикл
				
				//Проверяем только записи которые были сегодня
				Если ЗначениеЗаполнено(Строка.Период) и Строка.Период < (ТекущаяДата() - 3600) Тогда
					Продолжить;
				КонецЕсли;	
				
				Если не Строка.Разработчик = глЗначениеПеременной("глТекущийПользователь") Тогда
					Продолжить;
				КонецЕсли;				
				
				НайденаСтрокаВПределахЧаса = Истина;
				
				Если СтрДлина(Строка.Описание) < 20 
					или НЕ ЗначениеЗаполнено(Строка.Владелец) 
					или НЕ ЗначениеЗаполнено(Строка.Разработчик)
					или НЕ ЗначениеЗаполнено(Строка.Период)Тогда
					
					Сообщить("Заполните поле владелец и описание (не менее 20 символов) в табличной части:""История изменения""",СтатусСообщения.Важное);
					Отказ = Истина;
				
				КонецЕсли;
				
			КонецЦикла;	
			
			Если НЕ НайденаСтрокаВПределахЧаса Тогда 
				
				Сообщить("Не найдено ни одной новой строки в тч ""История изменения"" по разработчику: "+глЗначениеПеременной("глТекущийПользователь")+"!",СтатусСообщения.Важное);
				Отказ = Истина;
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		НастройкаПравДоступа.ОбновитьПраваДоступаКИерархическимОбъектамПриНеобходимости(Ссылка,ПрошлыйИзмененныйРодительОбъектаДоступа, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры
